# Quilmes - Lift analysis - Denis Trosman

# Libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

import warnings
warnings.filterwarnings('ignore')

# Configs
pd.options.display.float_format = '{:.2f}'.format
pd.set_option('display.max_colwidth', None)
pd.set_option('display.max_columns', None)
color_pal = sns.color_palette()
plt.style.use('fivethirtyeight')

In [2]:
import sys
sys.path.insert(0, '../')
from src.eda import analyze_df

# Read files

#### Client data

● La columna “chanel_segmentation” se refiere al tipo de negocio donde se venden los
productos: Autoservicios, kioscos y tradicional (almacén).

● La columna "business” se refiere al tipo de producto al que hace referencia la campaña (CZA:
Cerveza y NABS: bebidas sin alcohol).

In [3]:
df_clients = pd.read_csv('../data/clients.csv')
df_channels = pd.read_csv('../data/channel_segmentation.csv')

In [4]:
analyze_df(df_clients)

Number of rows: 49458, Number of columns:3

Duplicated amount: 4

------------------------------Number of null values------------------------------
cliente_id    0
channel_id    0
region        0
dtype: int64
------------------------------Type of variables------------------------------
cliente_id     int64
channel_id     int64
region        object
dtype: object

   cliente_id  channel_id           region
0 -1726485189  1759010777  COSTA ATLANTICA
1  -928788236  1625004744   GBA MINORISTAS
2  1641917107  1625004744  COSTA ATLANTICA
3  1273086795  1625004744   GBA MINORISTAS
4 -1708080869  1625004744  COSTA ATLANTICA

In [5]:
analyze_df(df_channels)

Number of rows: 38, Number of columns:2

Duplicated amount: 0

------------------------------Number of null values------------------------------
channel_id              0
channel_segmentation    0
dtype: int64
------------------------------Type of variables------------------------------
channel_id               int64
channel_segmentation    object
dtype: object

   channel_id channel_segmentation
0   565501238                   NO
1  1377949257                   NO
2  1059805429                OTROS
3  -808273538                   NO
4 -1995572528          RESTAURANTE

#### Promotions data

● El data set “coupons.csv” tiene una columna que se llama “sales_with_coupons”. Esta
columna tiene la cantidad de ventas que se generaron bajo alguna promoción efectuada
durante alguna campaña.

● Según el área de inteligencia comercial, se considera que el cliente fue participe de la
campaña, si efectúo más de 5 compras (“sales_with_coupons” > 5).

● El data set “blacklist.csv” indica los clientes que no hay que considerar en el estudio por
motivos varios.

In [6]:
df_coupons = pd.read_csv('../data/coupons.csv')
df_blacklist = pd.read_csv('../data/blacklist.csv')

In [7]:
analyze_df(df_coupons)

Number of rows: 805757, Number of columns:5

Duplicated amount: 1

------------------------------Number of null values------------------------------
cliente_id            0
business              0
brand                 0
yearmonth             0
sales_with_coupons    0
dtype: int64
------------------------------Type of variables------------------------------
cliente_id             int64
business              object
brand                 object
yearmonth              int64
sales_with_coupons     int64
dtype: object

   cliente_id business          brand  yearmonth  sales_with_coupons
0 -1133775360      CZA  brahma_dorada     202307                  53
1 -2013629997      CZA          andes     202304                 483
2 -1623564940      CZA        quilmes     202310                  41
3  2137524281      CZA        quilmes     202212                   1
4  -301975142      CZA    doble_malta     202210                   2

In [8]:
analyze_df(df_blacklist)

Number of rows: 5937, Number of columns:1

Duplicated amount: 0

------------------------------Number of null values------------------------------
cliente_id    0
dtype: int64
------------------------------Type of variables------------------------------
cliente_id    int64
dtype: object

   cliente_id
0  2076569343
1   486609981
2 -2133238226
3  1501782976
4 -1672885383

#### Sales data

In [9]:
df_sales_2022_1 = pd.read_csv('../data/sales_2022_sementre_1.csv')
df_sales_2022_2 = pd.read_csv('../data/sales_2022_semestre_2.csv')
df_sales_2023_1 = pd.read_csv('../data/sales_2023_semestre_1.csv')

In [10]:
analyze_df(df_sales_2022_1)

Number of rows: 588683, Number of columns:5

Duplicated amount: 0

------------------------------Number of null values------------------------------
cliente_id    0
business      0
brand         0
sales         0
yearmonth     0
dtype: int64
------------------------------Type of variables------------------------------
cliente_id      int64
business       object
brand          object
sales         float64
yearmonth       int64
dtype: object

   cliente_id business    brand  sales  yearmonth
0  1690894282      CZA  quilmes   1.82     202201
1  -985525432      CZA   brahma   0.74     202201
2  -674489716      CZA   brahma   4.55     202201
3  1026124970      CZA   brahma   1.26     202201
4 -2030441626      CZA  quilmes   0.20     202201

In [11]:
analyze_df(df_sales_2022_2)

Number of rows: 613864, Number of columns:5

Duplicated amount: 0

------------------------------Number of null values------------------------------
cliente_id    0
business      0
brand         0
sales         0
yearmonth     0
dtype: int64
------------------------------Type of variables------------------------------
cliente_id      int64
business       object
brand          object
sales         float64
yearmonth       int64
dtype: object

   cliente_id business         brand  sales  yearmonth
0 -1488116429      CZA       quilmes 290.57     202211
1 -1833555306      CZA        brahma   1.59     202211
2 -1369064580      CZA       quilmes   0.73     202211
3  2008344780      CZA       quilmes   0.73     202211
4   647173935      CZA  andes_origen   0.34     202211

In [12]:
analyze_df(df_sales_2023_1)

Number of rows: 571918, Number of columns:5

Duplicated amount: 0

------------------------------Number of null values------------------------------
cliente_id    0
business      0
brand         0
sales         0
yearmonth     0
dtype: int64
------------------------------Type of variables------------------------------
cliente_id      int64
business       object
brand          object
sales         float64
yearmonth       int64
dtype: object

   cliente_id business    brand  sales  yearmonth
0   883821370      CZA  quilmes   3.24     202303
1  1602484641      CZA   brahma  80.11     202303
2  -124654407      CZA  quilmes   1.02     202303
3  2095908164      CZA  quilmes  14.53     202303
4 -1143586715      CZA  quilmes   0.15     202303

# Filters and unification

Delete duplicated values from clients (4) and coupons (1) datasets

In [13]:
df_clients.drop_duplicates(inplace=True)
df_coupons.drop_duplicates(inplace=True)

Datasets have no null values

Delete clients in blacklist: 1040 removed

In [14]:
df_clients = df_clients.merge(df_blacklist,on='cliente_id',how='left',indicator=True).query('_merge == "left_only"').drop('_merge', axis=1)

Add channel name. Even though there are clients with more than one channel segmentation, those duplicates won't be removed.

In [15]:
df_clients = df_clients.merge(df_channels, on='channel_id',how='left')

Filter 3 needed channels

In [16]:
channels_list = ['TRADICIONAL','AUTOSERVICIOS','KIOSCOS']

In [17]:
df_clients = df_clients[df_clients.channel_segmentation.isin(channels_list)]

In [18]:
df_clients.shape

(38326, 4)

In [19]:
df_clients.head()

   cliente_id  channel_id           region channel_segmentation
1  -928788236  1625004744   GBA MINORISTAS          TRADICIONAL
2  1641917107  1625004744  COSTA ATLANTICA          TRADICIONAL
3  1273086795  1625004744   GBA MINORISTAS          TRADICIONAL
4 -1708080869  1625004744  COSTA ATLANTICA          TRADICIONAL
5   108603926   870267989   GBA MINORISTAS              KIOSCOS

Create campaing atribute - Lift

In [20]:
df_coupons['campaign'] = [1 if x>5 else 0 for x in df_coupons.sales_with_coupons]

In [21]:
df_coupons.campaign.value_counts(normalize=True)

campaign
0   0.68
1   0.32
Name: proportion, dtype: float64

Merge with clients dataset

In [23]:
df_coupons.shape

(805756, 6)

In [24]:
df_coupons.head()

   cliente_id business          brand  yearmonth  sales_with_coupons  campaign
0 -1133775360      CZA  brahma_dorada     202307                  53         1
1 -2013629997      CZA          andes     202304                 483         1
2 -1623564940      CZA        quilmes     202310                  41         1
3  2137524281      CZA        quilmes     202212                   1         0
4  -301975142      CZA    doble_malta     202210                   2         0

In [29]:
df = df_coupons.merge(df_clients,on='cliente_id',how='left').dropna()

Number of rows drops because we have implicitly applied the channels and blacklist filters

In [30]:
df.shape

(128013, 9)

There's only CZA products

In [32]:
df.business.unique()

array(['CZA'], dtype=object)

In [33]:
df.drop(columns=['channel_id'],inplace=True) # No longer need the channel code

Final look at dataset (without sales data)

In [34]:
df.head()

,cliente_id,business,brand,yearmonth,sales_with_coupons,campaign,region,channel_segmentation
7,-189677826,CZA,quilmes,202305,4,0,COSTA ATLANTICA,TRADICIONAL
23,-1380570683,CZA,stella_artois,202310,18,1,NOA,TRADICIONAL
29,780479776,CZA,quilmes,202304,314,1,PATAGONIA,TRADICIONAL
36,-1848249141,CZA,brahma,202310,43,1,GBA MINORISTAS,AUTOSERVICIOS
37,-593571610,CZA,andes_origen,202301,17,1,CENTRAL,AUTOSERVICIOS

Separate DF in 3 channels

In [35]:
df_tradicional = df[df.channel_segmentation == 'TRADICIONAL'].copy()
df_autoservicio = df[df.channel_segmentation == 'AUTOSERVICIOS'].copy()
df_kiosco = df[df.channel_segmentation == 'KIOSCOS'].copy()

In [36]:
df_tradicional.shape, df_autoservicio.shape, df_kiosco.shape

((63267, 8), (47488, 8), (17258, 8))

### Combine with sales data

Assumptions:

- Lift should be calculated considering each brand as a different product

Concat sales data

In [38]:
df_sales = pd.concat([df_sales_2022_1,df_sales_2022_2,df_sales_2023_1])

In [39]:
df_sales['year'] = [str(x)[:4] for x in df_sales.yearmonth] # Create year column

In [40]:
df_sales.head()

   cliente_id business    brand  sales  yearmonth  year
0  1690894282      CZA  quilmes   1.82     202201  2022
1  -985525432      CZA   brahma   0.74     202201  2022
2  -674489716      CZA   brahma   4.55     202201  2022
3  1026124970      CZA   brahma   1.26     202201  2022
4 -2030441626      CZA  quilmes   0.20     202201  2022

In [41]:
df_sales.business.unique()

array(['CZA'], dtype=object)

**Traditional channel**

In [42]:
df_tradicional

,cliente_id,business,brand,yearmonth,sales_with_coupons,campaign,region,channel_segmentation
7,-189677826,CZA,quilmes,202305,4,0,COSTA ATLANTICA,TRADICIONAL
23,-1380570683,CZA,stella_artois,202310,18,1,NOA,TRADICIONAL
29,780479776,CZA,quilmes,202304,314,1,PATAGONIA,TRADICIONAL
40,-1460380897,CZA,otras,202305,10,1,LITORAL,TRADICIONAL
45,780479776,CZA,stella_artois,202210,138,1,PATAGONIA,TRADICIONAL
...,...,...,...,...,...,...,...,...
805714,36256974,CZA,brahma,202205,1,0,PATAGONIA,TRADICIONAL
805722,595418458,CZA,doble_malta,202308,1,0,LITORAL,TRADICIONAL
805733,-1223201986,CZA,andes,202305,1,0,LITORAL,TRADICIONAL
805734,1447806133,CZA,quilmes,202210,1,0,NOA,TRADICIONAL
805742,-784993401,CZA,brahma,202303,1,0,LITORAL,TRADICIONAL

In [44]:
df_sales_2023_1.head()

   cliente_id business    brand  sales  yearmonth
0   883821370      CZA  quilmes   3.24     202303
1  1602484641      CZA   brahma  80.11     202303
2  -124654407      CZA  quilmes   1.02     202303
3  2095908164      CZA  quilmes  14.53     202303
4 -1143586715      CZA  quilmes   0.15     202303

In [49]:
df_tradicional.shape

(63267, 8)

In [43]:
temp = df_tradicional.merge(df_sales_2023_1,on=['cliente_id','yearmonth','brand','business'])

In [46]:
temp.shape

(12376, 9)

In [50]:
temp.groupby('campaign').agg(avg_sale = ('sales','mean'), count=('campaign','count'))

          avg_sale  count
campaign
0             1.08   8417
1             2.09   3959

In [45]:
temp.head()

,cliente_id,business,brand,yearmonth,sales_with_coupons,campaign,region,channel_segmentation,sales
0,780479776,CZA,quilmes,202304,314,1,PATAGONIA,TRADICIONAL,5.34
1,-1460380897,CZA,otras,202305,10,1,LITORAL,TRADICIONAL,0.20
2,1336846228,CZA,brahma,202303,271,1,GBA MINORISTAS,TRADICIONAL,2.28
3,-1457364094,CZA,andes_origen,202303,76,1,COSTA ATLANTICA,TRADICIONAL,2.66
4,70092016,CZA,quilmes,202301,1,0,LITORAL,TRADICIONAL,0.34

## Create experiment and control groups

In [119]:
df_t_camp = df_tradicional[df_tradicional.campaign == 1]
df_t_no_camp = df_tradicional[df_tradicional.campaign == 0]